In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.seed(101)
df = pd.DataFrame(data=np.random.randn(5,4),
                  index=['A', 'B', 'C', 'D', 'E'],  
                  columns=['Col1', 'Col2', 'Col3', 'Col4']
                  )
df

       Col1      Col2      Col3      Col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [3]:
df.loc['A']

Col1    2.706850
Col2    0.628133
Col3    0.907969
Col4    0.503826
Name: A, dtype: float64

In [4]:
type(df.loc['A'])

pandas.core.series.Series

In [ ]:
df.loc['E']

Col1    0.190794
Col2    1.978757
Col3    2.605967
Col4    0.683509
Name: E, dtype: float64

In [7]:
df.loc[['A', 'D']]

       Col1      Col2      Col3      Col4
A  2.706850  0.628133  0.907969  0.503826
D  0.188695 -0.758872 -0.933237  0.955057

In [8]:
type(df.loc[['A', 'D']])

pandas.core.frame.DataFrame

In [9]:
df.loc['A', 'Col1']

2.706849839399938

In [10]:
df.loc[['A', 'C', 'E'], ['Col1', 'Col3']]

       Col1      Col3
A  2.706850  0.907969
C -2.018168  0.528813
E  0.190794  2.605967

In [11]:
df.loc['A':'C', 'Col1':'Col4']  # Slicing rows and columns

       Col1      Col2      Col3      Col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [16]:
df.loc['A':'C', ['Col3']] # Slicing rows and selecting specific columns

       Col3
A  0.907969
B -0.848077
C  0.528813

In [17]:
df

       Col1      Col2      Col3      Col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df.loc['D', 'Col3']  # Accessing a specific cell

-0.9332372163009188

In [22]:
df.loc[['A'], ['Col2', 'Col4']] # Accessing specific rows and columns

       Col2      Col4
A  0.628133  0.503826

In [23]:
df.iloc[0]  # Accessing the first row using iloc

Col1    2.706850
Col2    0.628133
Col3    0.907969
Col4    0.503826
Name: A, dtype: float64

In [24]:
type(df.iloc[0])

pandas.core.series.Series

In [26]:
df.iloc[0, 2]  # Accessing a specific cell using iloc

0.9079694464765431

In [27]:
df

       Col1      Col2      Col3      Col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.iloc[[1, 2, 3]]

       Col1      Col2      Col3      Col4
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [31]:
df.iloc[[1, 2, 3], [1, 3]]  # Accessing specific rows and columns using iloc

       Col2      Col4
B -0.319318  0.605965
C  0.740122 -0.589001
D -0.758872  0.955057

In [32]:
df.iloc[:3]  # Accessing the first three rows using iloc

       Col1      Col2      Col3      Col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [34]:
df.iloc[:3,:3]  # Accessing the first three rows and columns using iloc

       Col1      Col2      Col3
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813

In [35]:
df.iloc[2:,3:]  # Accessing rows from index 2 to the end and the last column

       Col4
C -0.589001
D  0.955057
E  0.683509

In [36]:
df

       Col1      Col2      Col3      Col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df.query('(Col3 > 0.4 or Col4 > 0.7) and Col1 < 0.2')  # Querying the DataFrame with multiple conditions

       Col1      Col2      Col3      Col4
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509